#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch.develop["01-Documentation"] will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "01-Documentation"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.develop["communication-service"] will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "communication-service"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.develop["general-docs"] will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "general-docs"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.develop["to-do-api"] will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "to-do-api"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.develop["to-do-web"] will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "to-do-web"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.release["01-Documentation"] will be created
  + resource "github_branch" "release" {
      + branch        = "release"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "01-Documentation"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.release["communication-service"] will be created
  + resource "github_branch" "release" {
      + branch        = "release"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "communication-service"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.release["general-docs"] will be created
  + resource "github_branch" "release" {
      + branch        = "release"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "general-docs"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.release["to-do-api"] will be created
  + resource "github_branch" "release" {
      + branch        = "release"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "to-do-api"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.release["to-do-web"] will be created
  + resource "github_branch" "release" {
      + branch        = "release"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "to-do-web"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch_protection.main["01-Documentation"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["communication-service"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["general-docs"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["to-do-api"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["to-do-web"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_issue.initial_setup["Documentation"] will be created
  + resource "github_issue" "initial_setup" {
      + assignees  = [
          + "flovearth",
        ]
      + body       = <<-EOT
            ## Initial Project Setup
            
            This issue tracks the initial setup tasks for the Documentation project.
            
            ### Setup Tasks:
            - [ ] Create Project on GitHub
            - [ ] Configure development environment
            - [ ] Set up CI/CD pipeline
            - [ ] Create project documentation
            - [ ] Define coding standards
            - [ ] Set up issue templates
            - [ ] Configure branch protection rules
            
            Assigned to: @flovearth
        EOT
      + etag       = (known after apply)
      + id         = (known after apply)
      + issue_id   = (known after apply)
      + labels     = [
          + "priority:high",
          + "setup",
        ]
      + number     = (known after apply)
      + repository = "01-Documentation"
      + title      = "Initial Setup"
    }

  # github_issue.initial_setup["project-alpha"] will be created
  + resource "github_issue" "initial_setup" {
      + assignees  = [
          + "flovearth",
        ]
      + body       = <<-EOT
            ## Initial Project Setup
            
            This issue tracks the initial setup tasks for the project-alpha project.
            
            ### Setup Tasks:
            - [ ] Create Project on GitHub
            - [ ] Configure development environment
            - [ ] Set up CI/CD pipeline
            - [ ] Create project documentation
            - [ ] Define coding standards
            - [ ] Set up issue templates
            - [ ] Configure branch protection rules
            
            Assigned to: @flovearth
        EOT
      + etag       = (known after apply)
      + id         = (known after apply)
      + issue_id   = (known after apply)
      + labels     = [
          + "priority:high",
          + "setup",
        ]
      + number     = (known after apply)
      + repository = "to-do-api"
      + title      = "Initial Setup"
    }

  # github_issue.initial_setup["project-beta"] will be created
  + resource "github_issue" "initial_setup" {
      + assignees  = [
          + "ismailaricioglu",
        ]
      + body       = <<-EOT
            ## Initial Project Setup
            
            This issue tracks the initial setup tasks for the project-beta project.
            
            ### Setup Tasks:
            - [ ] Create Project on GitHub
            - [ ] Configure development environment
            - [ ] Set up CI/CD pipeline
            - [ ] Create project documentation
            - [ ] Define coding standards
            - [ ] Set up issue templates
            - [ ] Configure branch protection rules
            
            Assigned to: @ismailaricioglu
        EOT
      + etag       = (known after apply)
      + id         = (known after apply)
      + issue_id   = (known after apply)
      + labels     = [
          + "priority:high",
          + "setup",
        ]
      + number     = (known after apply)
      + repository = "communication-service"
      + title      = "Initial Setup"
    }

  # github_issue.initial_setup["project-gamma"] will be created
  + resource "github_issue" "initial_setup" {
      + assignees  = [
          + "egeren",
        ]
      + body       = <<-EOT
            ## Initial Project Setup
            
            This issue tracks the initial setup tasks for the project-gamma project.
            
            ### Setup Tasks:
            - [ ] Create Project on GitHub
            - [ ] Configure development environment
            - [ ] Set up CI/CD pipeline
            - [ ] Create project documentation
            - [ ] Define coding standards
            - [ ] Set up issue templates
            - [ ] Configure branch protection rules
            
            Assigned to: @egeren
        EOT
      + etag       = (known after apply)
      + id         = (known after apply)
      + issue_id   = (known after apply)
      + labels     = [
          + "priority:high",
          + "setup",
        ]
      + number     = (known after apply)
      + repository = "general-docs"
      + title      = "Initial Setup"
    }

  # github_issue_label.priority_high["01-Documentation"] will be created
  + resource "github_issue_label" "priority_high" {
      + color       = "d93f0b"
      + description = "High priority tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "priority:high"
      + repository  = "01-Documentation"
      + url         = (known after apply)
    }

  # github_issue_label.priority_high["communication-service"] will be created
  + resource "github_issue_label" "priority_high" {
      + color       = "d93f0b"
      + description = "High priority tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "priority:high"
      + repository  = "communication-service"
      + url         = (known after apply)
    }

  # github_issue_label.priority_high["general-docs"] will be created
  + resource "github_issue_label" "priority_high" {
      + color       = "d93f0b"
      + description = "High priority tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "priority:high"
      + repository  = "general-docs"
      + url         = (known after apply)
    }

  # github_issue_label.priority_high["to-do-api"] will be created
  + resource "github_issue_label" "priority_high" {
      + color       = "d93f0b"
      + description = "High priority tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "priority:high"
      + repository  = "to-do-api"
      + url         = (known after apply)
    }

  # github_issue_label.priority_high["to-do-web"] will be created
  + resource "github_issue_label" "priority_high" {
      + color       = "d93f0b"
      + description = "High priority tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "priority:high"
      + repository  = "to-do-web"
      + url         = (known after apply)
    }

  # github_issue_label.setup["01-Documentation"] will be created
  + resource "github_issue_label" "setup" {
      + color       = "1d76db"
      + description = "Initial setup tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "setup"
      + repository  = "01-Documentation"
      + url         = (known after apply)
    }

  # github_issue_label.setup["communication-service"] will be created
  + resource "github_issue_label" "setup" {
      + color       = "1d76db"
      + description = "Initial setup tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "setup"
      + repository  = "communication-service"
      + url         = (known after apply)
    }

  # github_issue_label.setup["general-docs"] will be created
  + resource "github_issue_label" "setup" {
      + color       = "1d76db"
      + description = "Initial setup tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "setup"
      + repository  = "general-docs"
      + url         = (known after apply)
    }

  # github_issue_label.setup["to-do-api"] will be created
  + resource "github_issue_label" "setup" {
      + color       = "1d76db"
      + description = "Initial setup tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "setup"
      + repository  = "to-do-api"
      + url         = (known after apply)
    }

  # github_issue_label.setup["to-do-web"] will be created
  + resource "github_issue_label" "setup" {
      + color       = "1d76db"
      + description = "Initial setup tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "setup"
      + repository  = "to-do-web"
      + url         = (known after apply)
    }

  # github_repository.repo["01-Documentation"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Topluluk için genel dokümantasyon"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "01-Documentation"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.repo["communication-service"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Core service for Project Communication"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "communication-service"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.repo["general-docs"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Documentation for Project General Docs"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "general-docs"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.repo["to-do-api"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "API service for Project To-Do"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "to-do-api"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.repo["to-do-web"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Web interface for Project To-Do"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "to-do-web"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository_collaborator.lead["01-Documentation"] will be created
  + resource "github_repository_collaborator" "lead" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "01-Documentation"
      + username                    = "flovearth"
    }

  # github_repository_collaborator.lead["communication-service"] will be created
  + resource "github_repository_collaborator" "lead" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "communication-service"
      + username                    = "ismailaricioglu"
    }

  # github_repository_collaborator.lead["general-docs"] will be created
  + resource "github_repository_collaborator" "lead" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "general-docs"
      + username                    = "egeren"
    }

  # github_repository_collaborator.lead["to-do-api"] will be created
  + resource "github_repository_collaborator" "lead" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "to-do-api"
      + username                    = "flovearth"
    }

  # github_repository_collaborator.lead["to-do-web"] will be created
  + resource "github_repository_collaborator" "lead" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "to-do-web"
      + username                    = "flovearth"
    }

  # github_repository_file.codeowners["01-Documentation"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add CODEOWNERS file"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            * @flovearth
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "01-Documentation"
      + sha                          = (known after apply)
    }

  # github_repository_file.codeowners["communication-service"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add CODEOWNERS file"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            * @ismailaricioglu
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "communication-service"
      + sha                          = (known after apply)
    }

  # github_repository_file.codeowners["general-docs"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add CODEOWNERS file"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            * @egeren
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "general-docs"
      + sha                          = (known after apply)
    }

  # github_repository_file.codeowners["to-do-api"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add CODEOWNERS file"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            * @flovearth
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-api"
      + sha                          = (known after apply)
    }

  # github_repository_file.codeowners["to-do-web"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add CODEOWNERS file"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            * @flovearth
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-web"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_project["01-Documentation"] will be created
  + resource "github_repository_file" "docs_project" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add project documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Documentation Project
            
            Welcome to the Documentation project wiki!
            
            ## Project Overview
            
            Sample project description for Documentation
            
            This project is designed to deliver high-quality solutions using modern development practices and collaborative workflows.
            
            ## Project Lead
            
            👤 **Project Lead**: @flovearth
            
            ## Quick Links
            
            - [Team Information](TEAM.md)
            - [Getting Started](#getting-started)
            - [Development Guidelines](#development-guidelines)
            - [Architecture](#architecture)
            
            ## Getting Started
            
            ### Prerequisites
            
            - Git installed on your local machine
            - Access to the project repositories
            - Development environment setup (see specific repo README files)
            
            ### Setup Instructions
            
            1. Clone the repository
            2. Follow the setup instructions in the README
            3. Join the project team channels
            4. Review the initial setup issue for current tasks
            
            ## Development Guidelines
            
            ### Workflow
            
            1. **Issues**: All work should be tracked via GitHub issues
            2. **Branches**: Create feature branches from main
            3. **Pull Requests**: All changes must go through PR review
            4. **Code Review**: Required approval from project lead or designated reviewers
            
            ### Standards
            
            - Follow the coding standards defined in each repository
            - Write clear commit messages
            - Include tests for new features
            - Update documentation as needed
            
            ## Contributing
            
            1. Check the [Team](TEAM.md) page for current team members and roles
            2. Review open issues for tasks that need attention
            3. Follow the development workflow outlined above
            4. Reach out to the project lead for questions
            
            ---
            
            *Last updated: Generated by Terraform*
        EOT
      + file                         = "docs/PROJECT.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "01-Documentation"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_project["communication-service"] will be created
  + resource "github_repository_file" "docs_project" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add project documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-beta Project
            
            Welcome to the project-beta project wiki!
            
            ## Project Overview
            
            Sample project description for project-beta
            
            This project is designed to deliver high-quality solutions using modern development practices and collaborative workflows.
            
            ## Project Lead
            
            👤 **Project Lead**: @ismailaricioglu
            
            ## Quick Links
            
            - [Team Information](TEAM.md)
            - [Getting Started](#getting-started)
            - [Development Guidelines](#development-guidelines)
            - [Architecture](#architecture)
            
            ## Getting Started
            
            ### Prerequisites
            
            - Git installed on your local machine
            - Access to the project repositories
            - Development environment setup (see specific repo README files)
            
            ### Setup Instructions
            
            1. Clone the repository
            2. Follow the setup instructions in the README
            3. Join the project team channels
            4. Review the initial setup issue for current tasks
            
            ## Development Guidelines
            
            ### Workflow
            
            1. **Issues**: All work should be tracked via GitHub issues
            2. **Branches**: Create feature branches from main
            3. **Pull Requests**: All changes must go through PR review
            4. **Code Review**: Required approval from project lead or designated reviewers
            
            ### Standards
            
            - Follow the coding standards defined in each repository
            - Write clear commit messages
            - Include tests for new features
            - Update documentation as needed
            
            ## Contributing
            
            1. Check the [Team](TEAM.md) page for current team members and roles
            2. Review open issues for tasks that need attention
            3. Follow the development workflow outlined above
            4. Reach out to the project lead for questions
            
            ---
            
            *Last updated: Generated by Terraform*
        EOT
      + file                         = "docs/PROJECT.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "communication-service"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_project["general-docs"] will be created
  + resource "github_repository_file" "docs_project" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add project documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-gamma Project
            
            Welcome to the project-gamma project wiki!
            
            ## Project Overview
            
            Sample project description for project-gamma
            
            This project is designed to deliver high-quality solutions using modern development practices and collaborative workflows.
            
            ## Project Lead
            
            👤 **Project Lead**: @egeren
            
            ## Quick Links
            
            - [Team Information](TEAM.md)
            - [Getting Started](#getting-started)
            - [Development Guidelines](#development-guidelines)
            - [Architecture](#architecture)
            
            ## Getting Started
            
            ### Prerequisites
            
            - Git installed on your local machine
            - Access to the project repositories
            - Development environment setup (see specific repo README files)
            
            ### Setup Instructions
            
            1. Clone the repository
            2. Follow the setup instructions in the README
            3. Join the project team channels
            4. Review the initial setup issue for current tasks
            
            ## Development Guidelines
            
            ### Workflow
            
            1. **Issues**: All work should be tracked via GitHub issues
            2. **Branches**: Create feature branches from main
            3. **Pull Requests**: All changes must go through PR review
            4. **Code Review**: Required approval from project lead or designated reviewers
            
            ### Standards
            
            - Follow the coding standards defined in each repository
            - Write clear commit messages
            - Include tests for new features
            - Update documentation as needed
            
            ## Contributing
            
            1. Check the [Team](TEAM.md) page for current team members and roles
            2. Review open issues for tasks that need attention
            3. Follow the development workflow outlined above
            4. Reach out to the project lead for questions
            
            ---
            
            *Last updated: Generated by Terraform*
        EOT
      + file                         = "docs/PROJECT.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "general-docs"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_project["to-do-api"] will be created
  + resource "github_repository_file" "docs_project" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add project documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-alpha Project
            
            Welcome to the project-alpha project wiki!
            
            ## Project Overview
            
            Sample project description for project-alpha
            
            This project is designed to deliver high-quality solutions using modern development practices and collaborative workflows.
            
            ## Project Lead
            
            👤 **Project Lead**: @flovearth
            
            ## Quick Links
            
            - [Team Information](TEAM.md)
            - [Getting Started](#getting-started)
            - [Development Guidelines](#development-guidelines)
            - [Architecture](#architecture)
            
            ## Getting Started
            
            ### Prerequisites
            
            - Git installed on your local machine
            - Access to the project repositories
            - Development environment setup (see specific repo README files)
            
            ### Setup Instructions
            
            1. Clone the repository
            2. Follow the setup instructions in the README
            3. Join the project team channels
            4. Review the initial setup issue for current tasks
            
            ## Development Guidelines
            
            ### Workflow
            
            1. **Issues**: All work should be tracked via GitHub issues
            2. **Branches**: Create feature branches from main
            3. **Pull Requests**: All changes must go through PR review
            4. **Code Review**: Required approval from project lead or designated reviewers
            
            ### Standards
            
            - Follow the coding standards defined in each repository
            - Write clear commit messages
            - Include tests for new features
            - Update documentation as needed
            
            ## Contributing
            
            1. Check the [Team](TEAM.md) page for current team members and roles
            2. Review open issues for tasks that need attention
            3. Follow the development workflow outlined above
            4. Reach out to the project lead for questions
            
            ---
            
            *Last updated: Generated by Terraform*
        EOT
      + file                         = "docs/PROJECT.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-api"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_project["to-do-web"] will be created
  + resource "github_repository_file" "docs_project" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add project documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-alpha Project
            
            Welcome to the project-alpha project wiki!
            
            ## Project Overview
            
            Sample project description for project-alpha
            
            This project is designed to deliver high-quality solutions using modern development practices and collaborative workflows.
            
            ## Project Lead
            
            👤 **Project Lead**: @flovearth
            
            ## Quick Links
            
            - [Team Information](TEAM.md)
            - [Getting Started](#getting-started)
            - [Development Guidelines](#development-guidelines)
            - [Architecture](#architecture)
            
            ## Getting Started
            
            ### Prerequisites
            
            - Git installed on your local machine
            - Access to the project repositories
            - Development environment setup (see specific repo README files)
            
            ### Setup Instructions
            
            1. Clone the repository
            2. Follow the setup instructions in the README
            3. Join the project team channels
            4. Review the initial setup issue for current tasks
            
            ## Development Guidelines
            
            ### Workflow
            
            1. **Issues**: All work should be tracked via GitHub issues
            2. **Branches**: Create feature branches from main
            3. **Pull Requests**: All changes must go through PR review
            4. **Code Review**: Required approval from project lead or designated reviewers
            
            ### Standards
            
            - Follow the coding standards defined in each repository
            - Write clear commit messages
            - Include tests for new features
            - Update documentation as needed
            
            ## Contributing
            
            1. Check the [Team](TEAM.md) page for current team members and roles
            2. Review open issues for tasks that need attention
            3. Follow the development workflow outlined above
            4. Reach out to the project lead for questions
            
            ---
            
            *Last updated: Generated by Terraform*
        EOT
      + file                         = "docs/PROJECT.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-web"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_team["01-Documentation"] will be created
  + resource "github_repository_file" "docs_team" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add team documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Documentation Team
            
            ## Team Members
            
            | Role | Seniority | Tech Stack | Notes | Status |
            |------|-----------|------------|-------|--------|
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            
            ## Role Definitions
            
            ### Project Lead
            - Overall project responsibility
            - Technical decision making
            - Team coordination
            - Stakeholder communication
            
            ### Senior Developer
            - Technical leadership
            - Architecture decisions
            - Code review and mentoring
            - Complex feature development
            
            ### Developer
            - Feature development
            - Bug fixes
            - Code review participation
            - Documentation updates
            
            ### Junior Developer
            - Learning and development
            - Simple feature implementation
            - Bug fixes under guidance
            - Documentation maintenance
            
            ## Seniority Levels
            
            - **Senior (5+ years)**: Independent work, mentoring others, architectural decisions
            - **Mid (2-5 years)**: Independent feature development, some mentoring
            - **Junior (0-2 years)**: Learning, guided development, growing skills
            
            ## Tech Stack Categories
            
            Common technology areas for this project:
            
            - **Frontend**: React, Vue, Angular, HTML/CSS, JavaScript/TypeScript
            - **Backend**: Node.js, Python, Java, Go, PHP, .NET
            - **Database**: PostgreSQL, MySQL, MongoDB, Redis
            - **DevOps**: Docker, Kubernetes, AWS, Azure, GCP
            - **Mobile**: React Native, Flutter, iOS, Android
            - **Other**: Specify other relevant technologies
            
            ## Status Options
            
            - **Active**: Currently working on the project
            - **On Leave**: Temporarily away from the project
            - **Alumni**: Former team member
            - **Consultant**: External contributor
            
            ## Notes
            
            Use the Notes column for:
            - Specific areas of expertise
            - Availability constraints
            - Special responsibilities
            - Contact preferences
            - Time zone information
            
            ---
            
            *Update this table as team composition changes*
        EOT
      + file                         = "docs/TEAM.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "01-Documentation"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_team["communication-service"] will be created
  + resource "github_repository_file" "docs_team" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add team documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-beta Team
            
            ## Team Members
            
            | Role | Seniority | Tech Stack | Notes | Status |
            |------|-----------|------------|-------|--------|
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            
            ## Role Definitions
            
            ### Project Lead
            - Overall project responsibility
            - Technical decision making
            - Team coordination
            - Stakeholder communication
            
            ### Senior Developer
            - Technical leadership
            - Architecture decisions
            - Code review and mentoring
            - Complex feature development
            
            ### Developer
            - Feature development
            - Bug fixes
            - Code review participation
            - Documentation updates
            
            ### Junior Developer
            - Learning and development
            - Simple feature implementation
            - Bug fixes under guidance
            - Documentation maintenance
            
            ## Seniority Levels
            
            - **Senior (5+ years)**: Independent work, mentoring others, architectural decisions
            - **Mid (2-5 years)**: Independent feature development, some mentoring
            - **Junior (0-2 years)**: Learning, guided development, growing skills
            
            ## Tech Stack Categories
            
            Common technology areas for this project:
            
            - **Frontend**: React, Vue, Angular, HTML/CSS, JavaScript/TypeScript
            - **Backend**: Node.js, Python, Java, Go, PHP, .NET
            - **Database**: PostgreSQL, MySQL, MongoDB, Redis
            - **DevOps**: Docker, Kubernetes, AWS, Azure, GCP
            - **Mobile**: React Native, Flutter, iOS, Android
            - **Other**: Specify other relevant technologies
            
            ## Status Options
            
            - **Active**: Currently working on the project
            - **On Leave**: Temporarily away from the project
            - **Alumni**: Former team member
            - **Consultant**: External contributor
            
            ## Notes
            
            Use the Notes column for:
            - Specific areas of expertise
            - Availability constraints
            - Special responsibilities
            - Contact preferences
            - Time zone information
            
            ---
            
            *Update this table as team composition changes*
        EOT
      + file                         = "docs/TEAM.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "communication-service"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_team["general-docs"] will be created
  + resource "github_repository_file" "docs_team" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add team documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-gamma Team
            
            ## Team Members
            
            | Role | Seniority | Tech Stack | Notes | Status |
            |------|-----------|------------|-------|--------|
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            
            ## Role Definitions
            
            ### Project Lead
            - Overall project responsibility
            - Technical decision making
            - Team coordination
            - Stakeholder communication
            
            ### Senior Developer
            - Technical leadership
            - Architecture decisions
            - Code review and mentoring
            - Complex feature development
            
            ### Developer
            - Feature development
            - Bug fixes
            - Code review participation
            - Documentation updates
            
            ### Junior Developer
            - Learning and development
            - Simple feature implementation
            - Bug fixes under guidance
            - Documentation maintenance
            
            ## Seniority Levels
            
            - **Senior (5+ years)**: Independent work, mentoring others, architectural decisions
            - **Mid (2-5 years)**: Independent feature development, some mentoring
            - **Junior (0-2 years)**: Learning, guided development, growing skills
            
            ## Tech Stack Categories
            
            Common technology areas for this project:
            
            - **Frontend**: React, Vue, Angular, HTML/CSS, JavaScript/TypeScript
            - **Backend**: Node.js, Python, Java, Go, PHP, .NET
            - **Database**: PostgreSQL, MySQL, MongoDB, Redis
            - **DevOps**: Docker, Kubernetes, AWS, Azure, GCP
            - **Mobile**: React Native, Flutter, iOS, Android
            - **Other**: Specify other relevant technologies
            
            ## Status Options
            
            - **Active**: Currently working on the project
            - **On Leave**: Temporarily away from the project
            - **Alumni**: Former team member
            - **Consultant**: External contributor
            
            ## Notes
            
            Use the Notes column for:
            - Specific areas of expertise
            - Availability constraints
            - Special responsibilities
            - Contact preferences
            - Time zone information
            
            ---
            
            *Update this table as team composition changes*
        EOT
      + file                         = "docs/TEAM.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "general-docs"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_team["to-do-api"] will be created
  + resource "github_repository_file" "docs_team" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add team documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-alpha Team
            
            ## Team Members
            
            | Role | Seniority | Tech Stack | Notes | Status |
            |------|-----------|------------|-------|--------|
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            
            ## Role Definitions
            
            ### Project Lead
            - Overall project responsibility
            - Technical decision making
            - Team coordination
            - Stakeholder communication
            
            ### Senior Developer
            - Technical leadership
            - Architecture decisions
            - Code review and mentoring
            - Complex feature development
            
            ### Developer
            - Feature development
            - Bug fixes
            - Code review participation
            - Documentation updates
            
            ### Junior Developer
            - Learning and development
            - Simple feature implementation
            - Bug fixes under guidance
            - Documentation maintenance
            
            ## Seniority Levels
            
            - **Senior (5+ years)**: Independent work, mentoring others, architectural decisions
            - **Mid (2-5 years)**: Independent feature development, some mentoring
            - **Junior (0-2 years)**: Learning, guided development, growing skills
            
            ## Tech Stack Categories
            
            Common technology areas for this project:
            
            - **Frontend**: React, Vue, Angular, HTML/CSS, JavaScript/TypeScript
            - **Backend**: Node.js, Python, Java, Go, PHP, .NET
            - **Database**: PostgreSQL, MySQL, MongoDB, Redis
            - **DevOps**: Docker, Kubernetes, AWS, Azure, GCP
            - **Mobile**: React Native, Flutter, iOS, Android
            - **Other**: Specify other relevant technologies
            
            ## Status Options
            
            - **Active**: Currently working on the project
            - **On Leave**: Temporarily away from the project
            - **Alumni**: Former team member
            - **Consultant**: External contributor
            
            ## Notes
            
            Use the Notes column for:
            - Specific areas of expertise
            - Availability constraints
            - Special responsibilities
            - Contact preferences
            - Time zone information
            
            ---
            
            *Update this table as team composition changes*
        EOT
      + file                         = "docs/TEAM.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-api"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_team["to-do-web"] will be created
  + resource "github_repository_file" "docs_team" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add team documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-alpha Team
            
            ## Team Members
            
            | Role | Seniority | Tech Stack | Notes | Status |
            |------|-----------|------------|-------|--------|
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            |      |           |            |       |        |
            
            ## Role Definitions
            
            ### Project Lead
            - Overall project responsibility
            - Technical decision making
            - Team coordination
            - Stakeholder communication
            
            ### Senior Developer
            - Technical leadership
            - Architecture decisions
            - Code review and mentoring
            - Complex feature development
            
            ### Developer
            - Feature development
            - Bug fixes
            - Code review participation
            - Documentation updates
            
            ### Junior Developer
            - Learning and development
            - Simple feature implementation
            - Bug fixes under guidance
            - Documentation maintenance
            
            ## Seniority Levels
            
            - **Senior (5+ years)**: Independent work, mentoring others, architectural decisions
            - **Mid (2-5 years)**: Independent feature development, some mentoring
            - **Junior (0-2 years)**: Learning, guided development, growing skills
            
            ## Tech Stack Categories
            
            Common technology areas for this project:
            
            - **Frontend**: React, Vue, Angular, HTML/CSS, JavaScript/TypeScript
            - **Backend**: Node.js, Python, Java, Go, PHP, .NET
            - **Database**: PostgreSQL, MySQL, MongoDB, Redis
            - **DevOps**: Docker, Kubernetes, AWS, Azure, GCP
            - **Mobile**: React Native, Flutter, iOS, Android
            - **Other**: Specify other relevant technologies
            
            ## Status Options
            
            - **Active**: Currently working on the project
            - **On Leave**: Temporarily away from the project
            - **Alumni**: Former team member
            - **Consultant**: External contributor
            
            ## Notes
            
            Use the Notes column for:
            - Specific areas of expertise
            - Availability constraints
            - Special responsibilities
            - Contact preferences
            - Time zone information
            
            ---
            
            *Update this table as team composition changes*
        EOT
      + file                         = "docs/TEAM.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-web"
      + sha                          = (known after apply)
    }

  # github_repository_file.readme["01-Documentation"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update README with project information"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Documentation
            
            Sample project description for Documentation
            
            ## 📋 Project Information
            
            - **Project Lead**: @flovearth
            - **Status**: Active Development
            - **Type**: Community Project
            
            ## 🚀 Quick Start
            
            1. **Clone the repository**
               ```bash
               git clone https://github.com/BKT-DevOps/01-Documentation.git
               cd 01-Documentation
               ```
            
            2. **Follow setup instructions**
               - Check the [Initial Setup Issue](../../issues/1) for current tasks
               - Review the [Team Documentation](docs/TEAM.md)
            
            3. **Join the team**
               - Read the [Project Documentation](docs/PROJECT.md)
               - Contact the project lead for access
            
            ## 📚 Documentation
            
            - [📖 Project Overview](docs/PROJECT.md) - Detailed project information
            - [👥 Team Information](docs/TEAM.md) - Team members and roles
            - [🐛 Issues](../../issues) - Track bugs and feature requests
            - [📋 Project Board](../../projects) - Kanban board for task management
            
            ## 🛠️ Development
            
            ### Prerequisites
            
            *Add specific prerequisites for this project*
            
            ### Installation
            
            *Add installation instructions*
            
            ### Usage
            
            *Add usage examples*
            
            ## 🤝 Contributing
            
            1. Check open issues for tasks that need attention
            2. Follow the development workflow in our [Project Documentation](docs/PROJECT.md)
            3. Create a feature branch and submit a pull request
            4. Ensure all tests pass and code follows our standards
            
            ## 📞 Contact
            
            - **Project Lead**: @flovearth
            - **Team**: See [Team Documentation](docs/TEAM.md)
            - **Issues**: Use GitHub issues for bug reports and feature requests
            
            ## 📄 License
            
            *Add license information*
            
            ---
            
            *This project is part of our community organization. For more information, see our [organization profile](../../..).*
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "01-Documentation"
      + sha                          = (known after apply)
    }

  # github_repository_file.readme["communication-service"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update README with project information"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-beta
            
            Sample project description for project-beta
            
            ## 📋 Project Information
            
            - **Project Lead**: @ismailaricioglu
            - **Status**: Active Development
            - **Type**: Community Project
            
            ## 🚀 Quick Start
            
            1. **Clone the repository**
               ```bash
               git clone https://github.com/BKT-DevOps/communication-service.git
               cd communication-service
               ```
            
            2. **Follow setup instructions**
               - Check the [Initial Setup Issue](../../issues/1) for current tasks
               - Review the [Team Documentation](docs/TEAM.md)
            
            3. **Join the team**
               - Read the [Project Documentation](docs/PROJECT.md)
               - Contact the project lead for access
            
            ## 📚 Documentation
            
            - [📖 Project Overview](docs/PROJECT.md) - Detailed project information
            - [👥 Team Information](docs/TEAM.md) - Team members and roles
            - [🐛 Issues](../../issues) - Track bugs and feature requests
            - [📋 Project Board](../../projects) - Kanban board for task management
            
            ## 🛠️ Development
            
            ### Prerequisites
            
            *Add specific prerequisites for this project*
            
            ### Installation
            
            *Add installation instructions*
            
            ### Usage
            
            *Add usage examples*
            
            ## 🤝 Contributing
            
            1. Check open issues for tasks that need attention
            2. Follow the development workflow in our [Project Documentation](docs/PROJECT.md)
            3. Create a feature branch and submit a pull request
            4. Ensure all tests pass and code follows our standards
            
            ## 📞 Contact
            
            - **Project Lead**: @ismailaricioglu
            - **Team**: See [Team Documentation](docs/TEAM.md)
            - **Issues**: Use GitHub issues for bug reports and feature requests
            
            ## 📄 License
            
            *Add license information*
            
            ---
            
            *This project is part of our community organization. For more information, see our [organization profile](../../..).*
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "communication-service"
      + sha                          = (known after apply)
    }

  # github_repository_file.readme["general-docs"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update README with project information"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-gamma
            
            Sample project description for project-gamma
            
            ## 📋 Project Information
            
            - **Project Lead**: @egeren
            - **Status**: Active Development
            - **Type**: Community Project
            
            ## 🚀 Quick Start
            
            1. **Clone the repository**
               ```bash
               git clone https://github.com/BKT-DevOps/general-docs.git
               cd general-docs
               ```
            
            2. **Follow setup instructions**
               - Check the [Initial Setup Issue](../../issues/1) for current tasks
               - Review the [Team Documentation](docs/TEAM.md)
            
            3. **Join the team**
               - Read the [Project Documentation](docs/PROJECT.md)
               - Contact the project lead for access
            
            ## 📚 Documentation
            
            - [📖 Project Overview](docs/PROJECT.md) - Detailed project information
            - [👥 Team Information](docs/TEAM.md) - Team members and roles
            - [🐛 Issues](../../issues) - Track bugs and feature requests
            - [📋 Project Board](../../projects) - Kanban board for task management
            
            ## 🛠️ Development
            
            ### Prerequisites
            
            *Add specific prerequisites for this project*
            
            ### Installation
            
            *Add installation instructions*
            
            ### Usage
            
            *Add usage examples*
            
            ## 🤝 Contributing
            
            1. Check open issues for tasks that need attention
            2. Follow the development workflow in our [Project Documentation](docs/PROJECT.md)
            3. Create a feature branch and submit a pull request
            4. Ensure all tests pass and code follows our standards
            
            ## 📞 Contact
            
            - **Project Lead**: @egeren
            - **Team**: See [Team Documentation](docs/TEAM.md)
            - **Issues**: Use GitHub issues for bug reports and feature requests
            
            ## 📄 License
            
            *Add license information*
            
            ---
            
            *This project is part of our community organization. For more information, see our [organization profile](../../..).*
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "general-docs"
      + sha                          = (known after apply)
    }

  # github_repository_file.readme["to-do-api"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update README with project information"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-alpha
            
            Sample project description for project-alpha
            
            ## 📋 Project Information
            
            - **Project Lead**: @flovearth
            - **Status**: Active Development
            - **Type**: Community Project
            
            ## 🚀 Quick Start
            
            1. **Clone the repository**
               ```bash
               git clone https://github.com/BKT-DevOps/to-do-api.git
               cd to-do-api
               ```
            
            2. **Follow setup instructions**
               - Check the [Initial Setup Issue](../../issues/1) for current tasks
               - Review the [Team Documentation](docs/TEAM.md)
            
            3. **Join the team**
               - Read the [Project Documentation](docs/PROJECT.md)
               - Contact the project lead for access
            
            ## 📚 Documentation
            
            - [📖 Project Overview](docs/PROJECT.md) - Detailed project information
            - [👥 Team Information](docs/TEAM.md) - Team members and roles
            - [🐛 Issues](../../issues) - Track bugs and feature requests
            - [📋 Project Board](../../projects) - Kanban board for task management
            
            ## 🛠️ Development
            
            ### Prerequisites
            
            *Add specific prerequisites for this project*
            
            ### Installation
            
            *Add installation instructions*
            
            ### Usage
            
            *Add usage examples*
            
            ## 🤝 Contributing
            
            1. Check open issues for tasks that need attention
            2. Follow the development workflow in our [Project Documentation](docs/PROJECT.md)
            3. Create a feature branch and submit a pull request
            4. Ensure all tests pass and code follows our standards
            
            ## 📞 Contact
            
            - **Project Lead**: @flovearth
            - **Team**: See [Team Documentation](docs/TEAM.md)
            - **Issues**: Use GitHub issues for bug reports and feature requests
            
            ## 📄 License
            
            *Add license information*
            
            ---
            
            *This project is part of our community organization. For more information, see our [organization profile](../../..).*
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-api"
      + sha                          = (known after apply)
    }

  # github_repository_file.readme["to-do-web"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update README with project information"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-alpha
            
            Sample project description for project-alpha
            
            ## 📋 Project Information
            
            - **Project Lead**: @flovearth
            - **Status**: Active Development
            - **Type**: Community Project
            
            ## 🚀 Quick Start
            
            1. **Clone the repository**
               ```bash
               git clone https://github.com/BKT-DevOps/to-do-web.git
               cd to-do-web
               ```
            
            2. **Follow setup instructions**
               - Check the [Initial Setup Issue](../../issues/1) for current tasks
               - Review the [Team Documentation](docs/TEAM.md)
            
            3. **Join the team**
               - Read the [Project Documentation](docs/PROJECT.md)
               - Contact the project lead for access
            
            ## 📚 Documentation
            
            - [📖 Project Overview](docs/PROJECT.md) - Detailed project information
            - [👥 Team Information](docs/TEAM.md) - Team members and roles
            - [🐛 Issues](../../issues) - Track bugs and feature requests
            - [📋 Project Board](../../projects) - Kanban board for task management
            
            ## 🛠️ Development
            
            ### Prerequisites
            
            *Add specific prerequisites for this project*
            
            ### Installation
            
            *Add installation instructions*
            
            ### Usage
            
            *Add usage examples*
            
            ## 🤝 Contributing
            
            1. Check open issues for tasks that need attention
            2. Follow the development workflow in our [Project Documentation](docs/PROJECT.md)
            3. Create a feature branch and submit a pull request
            4. Ensure all tests pass and code follows our standards
            
            ## 📞 Contact
            
            - **Project Lead**: @flovearth
            - **Team**: See [Team Documentation](docs/TEAM.md)
            - **Issues**: Use GitHub issues for bug reports and feature requests
            
            ## 📄 License
            
            *Add license information*
            
            ---
            
            *This project is part of our community organization. For more information, see our [organization profile](../../..).*
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-web"
      + sha                          = (known after apply)
    }

  # github_team.project["Documentation"] will be created
  + resource "github_team" "project" {
      + create_default_maintainer = false
      + description               = "Documentation projesi geliştirme ekibi"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Documentation"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.project["project-alpha"] will be created
  + resource "github_team" "project" {
      + create_default_maintainer = false
      + description               = "project-alpha projesi geliştirme ekibi"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "project-alpha"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.project["project-beta"] will be created
  + resource "github_team" "project" {
      + create_default_maintainer = false
      + description               = "project-beta projesi geliştirme ekibi"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "project-beta"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.project["project-gamma"] will be created
  + resource "github_team" "project" {
      + create_default_maintainer = false
      + description               = "project-gamma projesi geliştirme ekibi"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "project-gamma"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.members["Documentation-UsainSasal"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "UsainSasal"
    }

  # github_team_membership.members["Documentation-egeren"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "egeren"
    }

  # github_team_membership.members["Documentation-flovearth"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "flovearth"
    }

  # github_team_membership.members["Documentation-hulyaoner"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hulyaoner"
    }

  # github_team_membership.members["Documentation-ismailaricioglu"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "ismailaricioglu"
    }

  # github_team_membership.members["Documentation-lerkush"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "lerkush"
    }

  # github_team_membership.members["Documentation-onurceylan"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "onurceylan"
    }

  # github_team_membership.members["project-alpha-flovearth"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "flovearth"
    }

  # github_team_membership.members["project-alpha-hulyaoner"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hulyaoner"
    }

  # github_team_membership.members["project-alpha-ismailaricioglu"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "ismailaricioglu"
    }

  # github_team_membership.members["project-alpha-lerkush"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "lerkush"
    }

  # github_team_membership.members["project-beta-egeren"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "egeren"
    }

  # github_team_membership.members["project-beta-hulyaoner"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hulyaoner"
    }

  # github_team_membership.members["project-beta-ismailaricioglu"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "ismailaricioglu"
    }

  # github_team_membership.members["project-beta-lerkush"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "lerkush"
    }

  # github_team_membership.members["project-gamma-UsainSasal"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "UsainSasal"
    }

  # github_team_membership.members["project-gamma-egeren"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "egeren"
    }

  # github_team_membership.members["project-gamma-onurceylan"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "onurceylan"
    }

  # github_team_repository.access["01-Documentation"] will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "01-Documentation"
      + team_id    = (known after apply)
    }

  # github_team_repository.access["communication-service"] will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "communication-service"
      + team_id    = (known after apply)
    }

  # github_team_repository.access["general-docs"] will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "triage"
      + repository = "general-docs"
      + team_id    = (known after apply)
    }

  # github_team_repository.access["to-do-api"] will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "to-do-api"
      + team_id    = (known after apply)
    }

  # github_team_repository.access["to-do-web"] will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "to-do-web"
      + team_id    = (known after apply)
    }

Plan: 86 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + documentation_pages = {
      + Documentation = {
          + project_doc = (known after apply)
          + repository  = (known after apply)
          + team_doc    = (known after apply)
        }
      + project-alpha = {
          + project_doc = (known after apply)
          + repository  = (known after apply)
          + team_doc    = (known after apply)
        }
      + project-beta  = {
          + project_doc = (known after apply)
          + repository  = (known after apply)
          + team_doc    = (known after apply)
        }
      + project-gamma = {
          + project_doc = (known after apply)
          + repository  = (known after apply)
          + team_doc    = (known after apply)
        }
    }
  + initial_issues      = {
      + Documentation = {
          + assignees = [
              + "flovearth",
            ]
          + number    = (known after apply)
          + title     = "Initial Setup"
          + url       = (known after apply)
        }
      + project-alpha = {
          + assignees = [
              + "flovearth",
            ]
          + number    = (known after apply)
          + title     = "Initial Setup"
          + url       = (known after apply)
        }
      + project-beta  = {
          + assignees = [
              + "ismailaricioglu",
            ]
          + number    = (known after apply)
          + title     = "Initial Setup"
          + url       = (known after apply)
        }
      + project-gamma = {
          + assignees = [
              + "egeren",
            ]
          + number    = (known after apply)
          + title     = "Initial Setup"
          + url       = (known after apply)
        }
    }
  + project_summary     = {
      + projects           = {
          + Documentation = {
              + lead         = "flovearth"
              + main_repo    = "01-Documentation"
              + members      = 7
              + repositories = 1
            }
          + project-alpha = {
              + lead         = "flovearth"
              + main_repo    = "to-do-api"
              + members      = 4
              + repositories = 2
            }
          + project-beta  = {
              + lead         = "ismailaricioglu"
              + main_repo    = "communication-service"
              + members      = 4
              + repositories = 1
            }
          + project-gamma = {
              + lead         = "egeren"
              + main_repo    = "general-docs"
              + members      = 3
              + repositories = 1
            }
        }
      + total_memberships  = 18
      + total_projects     = 4
      + total_repositories = 5
    }
  + repositories        = {
      + "01-Documentation"    = {
          + clone_url     = (known after apply)
          + full_name     = (known after apply)
          + html_url      = (known after apply)
          + name          = "01-Documentation"
          + ssh_clone_url = (known after apply)
        }
      + communication-service = {
          + clone_url     = (known after apply)
          + full_name     = (known after apply)
          + html_url      = (known after apply)
          + name          = "communication-service"
          + ssh_clone_url = (known after apply)
        }
      + general-docs          = {
          + clone_url     = (known after apply)
          + full_name     = (known after apply)
          + html_url      = (known after apply)
          + name          = "general-docs"
          + ssh_clone_url = (known after apply)
        }
      + to-do-api             = {
          + clone_url     = (known after apply)
          + full_name     = (known after apply)
          + html_url      = (known after apply)
          + name          = "to-do-api"
          + ssh_clone_url = (known after apply)
        }
      + to-do-web             = {
          + clone_url     = (known after apply)
          + full_name     = (known after apply)
          + html_url      = (known after apply)
          + name          = "to-do-web"
          + ssh_clone_url = (known after apply)
        }
    }
  + team_memberships    = {
      + Documentation = {
          + lead         = "flovearth"
          + members      = [
              + "flovearth",
              + "ismailaricioglu",
              + "onurceylan",
              + "UsainSasal",
              + "egeren",
              + "hulyaoner",
              + "lerkush",
            ]
          + repositories = [
              + "01-Documentation",
            ]
        }
      + project-alpha = {
          + lead         = "flovearth"
          + members      = [
              + "ismailaricioglu",
              + "hulyaoner",
              + "lerkush",
              + "flovearth",
            ]
          + repositories = [
              + "to-do-api",
              + "to-do-web",
            ]
        }
      + project-beta  = {
          + lead         = "ismailaricioglu"
          + members      = [
              + "lerkush",
              + "ismailaricioglu",
              + "hulyaoner",
              + "egeren",
            ]
          + repositories = [
              + "communication-service",
            ]
        }
      + project-gamma = {
          + lead         = "egeren"
          + members      = [
              + "egeren",
              + "UsainSasal",
              + "onurceylan",
            ]
          + repositories = [
              + "general-docs",
            ]
        }
    }
  + teams               = {
      + Documentation = {
          + id   = (known after apply)
          + name = "Documentation"
          + slug = (known after apply)
        }
      + project-alpha = {
          + id   = (known after apply)
          + name = "project-alpha"
          + slug = (known after apply)
        }
      + project-beta  = {
          + id   = (known after apply)
          + name = "project-beta"
          + slug = (known after apply)
        }
      + project-gamma = {
          + id   = (known after apply)
          + name = "project-gamma"
          + slug = (known after apply)
        }
    }
  + wiki_pages          = {
      + Documentation = {
          + repository = "01-Documentation"
          + url        = "https://github.com/BKT-DevOps/01-Documentation/wiki"
        }
      + project-alpha = {
          + repository = "to-do-api"
          + url        = "https://github.com/BKT-DevOps/to-do-api/wiki"
        }
      + project-beta  = {
          + repository = "communication-service"
          + url        = "https://github.com/BKT-DevOps/communication-service/wiki"
        }
      + project-gamma = {
          + repository = "general-docs"
          + url        = "https://github.com/BKT-DevOps/general-docs/wiki"
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @flovearth, Action: `pull_request`*